### Author: Tejaswini Patil
### Reg No: 20MAI0044

**Dataset II : loan.csv**
#### **Assignment on feature engineering**

In [1]:
# Importing the necessary libraries
import numpy as np
import pandas as pd

In [2]:
# Lets get the data inside our dataframe
data = pd.read_csv('Data/loan.csv')

In [3]:
data.shape

(10000, 14)

In [4]:
# And see what our data looks like
data.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN

In [5]:
# Also what is the data type of the features available?
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             10000 non-null  int64
 1   disbursed_amount        10000 non-null  float64
 2   interest                10000 non-null  float64
 3   market                  10000 non-null  object
 4   employment              9389 non-null   object
 5   time_employed           9471 non-null   object
 6   householder             10000 non-null  object
 7   income                  10000 non-null  float64
 8   date_issued             10000 non-null  object
 9   target                  10000 non-null  int64
 10  loan_purpose            10000 non-null  object
 11  number_open_accounts    10000 non-null  float64
 12  date_last_payment       10000 non-null  object
 13  number_credit_lines_12  238 non-null    float64
dtypes: float64(5), int64(2), object(7)
memory usage: 1.1+ MB

#### Continuous Variables

In [6]:
# Here income and disbursed_amount are features with continuous values
print(data['income'].mean())
print(data['disbursed_amount'].mean())

71572.28728915
14132.2755

In [7]:
#data.groupby('disbursed_amount').mean()

In [8]:
#print(data['disbursed_amount'].value_counts())

#### Discrete Variables

In [9]:
cat_features=[i for i in data.columns if data.dtypes[i]=='object']

In [10]:
cat_features

['market',
 'employment',
 'time_employed',
 'householder',
 'date_issued',
 'loan_purpose',
 'date_last_payment']

In [11]:
print(data['market'].unique())

['C' 'B' 'A' 'E' 'D']

In [12]:
print(data['employment'].unique())

['Teacher' 'Accountant' 'Statistician' 'Other' 'Bus driver' 'Secretary'
 'Software developer' 'Nurse' 'Taxi driver' nan 'Civil Servant' 'Dentist']

In [13]:
print(data['householder'].unique())

['RENT' 'OWNER' 'MORTGAGE']

In [14]:
print(data['householder'].value_counts())

MORTGAGE    4957
RENT        4055
OWNER        988
Name: householder, dtype: int64

In [15]:
data[['date_issued','date_last_payment']].dtypes
data['date_issued_dt'] = pd.to_datetime(data['date_issued'])
data['date_last_payment_dt'] = pd.to_datetime(data['date_last_payment'])
#Extract Month from the date
data['month']= data['date_issued_dt'].dt.month

In [16]:
data.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12,date_issued_dt,date_last_payment_dt,month
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN,2013-06-11,2016-01-14,6
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN,2014-05-08,2016-01-25,5
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN,2013-10-26,2014-09-26,10
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN,2015-08-20,2016-01-26,8
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN,2014-07-22,2016-01-11,7

In [17]:
print(data['month'].value_counts())

10    1277
7     1066
11    1017
12     882
8      852
4      816
5      749
9      734
6      700
1      700
3      623
2      584
Name: month, dtype: int64

In [18]:
data['month'].value_counts()[:1].index.tolist()

[10]

In [19]:
for name, group in data.groupby(['employment', 'householder']):
    if(name[0]=='Teacher' and name[1]=='OWNER'):
        print(name)
        print(group)

('Teacher', 'OWNER')
      customer_id  disbursed_amount  interest market employment time_employed  \
71             71          10230.00    7.8900      A    Teacher      >5 years
85             85           3713.00   14.3068      C    Teacher      >5 years
171           171          19646.25   14.3904      C    Teacher     <=5 years
672           672          15200.00   10.8801      B    Teacher      >5 years
1024         1024          12144.00   14.2008      C    Teacher     <=5 years
...           ...               ...       ...    ...        ...           ...
9154         9154           9900.00   13.3855      B    Teacher      >5 years
9172         9172          22080.00   23.6509      E    Teacher      >5 years
9433         9433           4750.00   10.4405      B    Teacher     <=5 years
9684         9684           6650.00    7.4955      A    Teacher      >5 years
9769         9769          16005.00   12.5631      C    Teacher      >5 years

     householder    income date_issued  target        loan_purpose  \
71         OWNER   93840.0  2015-02-21       0  Debt consolidation
85         OWNER   19950.0  2013-07-20       0  Debt consolidation
171        OWNER   44650.0  2014-09-14       0   Home improvements
672        OWNER   82450.0  2015-11-16       0  Debt consolidation
1024       OWNER   66240.0  2014-04-26       0  Debt consolidation
...          ...       ...         ...     ...                 ...
9154       OWNER   40000.0  2012-12-14       0  Debt consolidation
9172       OWNER  145500.0  2014-08-05       0               Other
9433       OWNER   24440.0  2015-07-12       0  Debt consolidation
9684       OWNER   79200.0  2015-04-23       0  Debt consolidation
9769       OWNER   70560.0  2015-09-22       0  Debt consolidation

      number_open_accounts date_last_payment  number_credit_lines_12  \
71                    12.0        2015-04-15                     NaN
85                     2.0        2015-06-07                     NaN
171                   21.0        2016-01-10                     NaN
672                   17.0        2016-01-27                     NaN
1024                   9.0        2015-03-15                     NaN
...                    ...               ...                     ...
9154                   6.0        2013-02-20                     NaN
9172                  24.0        2016-01-06                     NaN
9433                   5.0        2016-01-22                     NaN
9684                  11.0        2015-12-06                     NaN
9769                  12.0        2016-01-20                     NaN

     date_issued_dt date_last_payment_dt  month
71       2015-02-21           2015-04-15      2
85       2013-07-20           2015-06-07      7
171      2014-09-14           2016-01-10      9
672      2015-11-16           2016-01-27     11
1024     2014-04-26           2015-03-15      4
...             ...                  ...    ...
9154     2012-12-14           2013-02-20     12
9172     2014-08-05           2016-01-06      8
9433     2015-07-12           2016-01-22      7
9684     2015-04-23           2015-12-06      4
9769     2015-09-22           2016-01-20      9

[69 rows x 17 columns]

In [20]:
data.groupby('employment')['householder'].apply(lambda ser: ser.str.contains("OWNER").sum())

employment
Accountant            90
Bus driver            96
Civil Servant         89
Dentist               71
Nurse                 78
Other                 85
Secretary             59
Software developer    76
Statistician          84
Taxi driver           80
Teacher               69
Name: householder, dtype: int64

#### Here we can see that there are 69 teachers who are owners as well

In [21]:
# And we can verify another way as well 
data.groupby('householder')['employment'].apply(lambda ser: ser.str.contains("Teacher").sum())

householder
MORTGAGE    421
OWNER        69
RENT        371
Name: employment, dtype: int64

In [22]:
data.groupby('employment')['householder'].apply(lambda ser: ser.str.contains("RENT").sum())

employment
Accountant            322
Bus driver            360
Civil Servant         371
Dentist               355
Nurse                 358
Other                 353
Secretary             355
Software developer    315
Statistician          342
Taxi driver           316
Teacher               371
Name: householder, dtype: int64

In [23]:
data.groupby('employment',sort=False)['householder'].apply(lambda ser: ser.str.contains("RENT").sum())

employment
Teacher               371
Accountant            322
Statistician          342
Other                 353
Bus driver            360
Secretary             355
Software developer    315
Nurse                 358
Taxi driver           316
Civil Servant         371
Dentist               355
Name: householder, dtype: int64

#### And employment of customers who mostly rent is Teacher and Civil Servant

In [24]:
data.groupby('householder')['employment'].apply(lambda ser: ser.str.contains("Teacher").sum())

householder
MORTGAGE    421
OWNER        69
RENT        371
Name: employment, dtype: int64

In [25]:
data.groupby('householder')['employment'].apply(lambda ser: ser.str.contains("Civil Servant").sum())

householder
MORTGAGE    424
OWNER        89
RENT        371
Name: employment, dtype: int64

In [26]:
data.groupby('householder')['employment'].apply(lambda ser: ser.str.contains("Taxi driver").sum())

householder
MORTGAGE    429
OWNER        80
RENT        316
Name: employment, dtype: int64

In [27]:
data.groupby('householder')['employment'].apply(lambda ser: ser.str.contains("Software developer").sum())

householder
MORTGAGE    417
OWNER        76
RENT        315
Name: employment, dtype: int64

#### Pandas again proves to be essential in understanding the variations in our data by querying it in various ways